In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [9]:
temperatures = pd.read_csv(r'E:\Notebook\single_temperature_dataset.csv')
temperatures

           date      city        country  avg_temp_c
0    2000-01-01    London             UK      12.074
1    2000-01-31  New York            USA      -0.714
2    2000-03-01    London             UK       7.986
3    2000-03-31      Xian          China       7.115
4    2000-04-30     Tokyo          Japan      29.439
..          ...       ...            ...         ...
295  2024-03-25    London             UK      10.597
296  2024-04-24   Abidjan  Côte D'Ivoire      17.050
297  2024-05-24     Tokyo          Japan      32.287
298  2024-06-23   Abidjan  Côte D'Ivoire      32.983
299  2024-07-23     Tokyo          Japan      17.669

[300 rows x 4 columns]

In [13]:
# Set the index of tempretures to city
temperatures_ind = temperatures.set_index("city")

# Look at temperatures_ind
print(temperatures_ind)

# Reset the temperatures_ind index, keeping its contents
print(temperatures_ind.reset_index())

# Reset the temperatures_ind index, dropping its contents
print(temperatures_ind.reset_index(drop = True))

                date        country  avg_temp_c
city
London    2000-01-01             UK      12.074
New York  2000-01-31            USA      -0.714
London    2000-03-01             UK       7.986
Xian      2000-03-31          China       7.115
Tokyo     2000-04-30          Japan      29.439
...              ...            ...         ...
London    2024-03-25             UK      10.597
Abidjan   2024-04-24  Côte D'Ivoire      17.050
Tokyo     2024-05-24          Japan      32.287
Abidjan   2024-06-23  Côte D'Ivoire      32.983
Tokyo     2024-07-23          Japan      17.669

[300 rows x 3 columns]
         city        date        country  avg_temp_c
0      London  2000-01-01             UK      12.074
1    New York  2000-01-31            USA      -0.714
2      London  2000-03-01             UK       7.986
3        Xian  2000-03-31          China       7.115
4       Tokyo  2000-04-30          Japan      29.439
..        ...         ...            ...         ...
295    London  2024-03-25             UK      10.597
296   Abidjan  2024-04-24  Côte D'Ivoire      17.050
297     Tokyo  2024-05-24          Japan      32.287
298   Abidjan  2024-06-23  Côte D'Ivoire      32.983
299     Tokyo  2024-07-23          Japan      17.669

[300 rows x 4 columns]
           date        country  avg_temp_c
0    2000-01-01             UK      12.074
1    2000-01-31            USA      -0.714
2    2000-03-01             UK       7.986
3    2000-03-31          China       7.115
4    2000-04-30          Japan      29.439
..          ...            ...         ...
295  2024-03-25             UK      10.597
296  2024-04-24  Côte D'Ivoire      17.050
297  2024-05-24          Japan      32.287
298  2024-06-23  Côte D'Ivoire      32.983
299  2024-07-23          Japan      17.669

[300 rows x 3 columns]

In [17]:
# Make a list of cities to subset on
cities = ["London", "Tokyo", "New York"]

# Subset temperatures using square brackets
print(temperatures[temperatures["city"].isin(cities)])

# Subset temperatures_ind using .loc[]
print(temperatures_ind.loc[cities])

           date      city country  avg_temp_c
0    2000-01-01    London      UK      12.074
1    2000-01-31  New York     USA      -0.714
2    2000-03-01    London      UK       7.986
4    2000-04-30     Tokyo   Japan      29.439
5    2000-05-30    London      UK      33.244
..          ...       ...     ...         ...
293  2024-01-25     Tokyo   Japan      17.854
294  2024-02-24  New York     USA      18.866
295  2024-03-25    London      UK      10.597
297  2024-05-24     Tokyo   Japan      32.287
299  2024-07-23     Tokyo   Japan      17.669

[160 rows x 4 columns]
                date country  avg_temp_c
city
London    2000-01-01      UK      12.074
London    2000-03-01      UK       7.986
London    2000-05-30      UK      33.244
London    2000-07-29      UK      17.115
London    2000-09-27      UK      28.361
...              ...     ...         ...
New York  2022-06-04     USA       9.598
New York  2022-12-31     USA      10.916
New York  2023-03-31     USA      22.361
New York  2023-12-26     USA      23.426
New York  2024-02-24     USA      18.866

[160 rows x 3 columns]

In [18]:
# Index temperatures by country & city
temperatures_ind = temperatures.set_index(["country","city"])

# List of tuples: Brazil, Rio De Janeiro & Pakistan, Lahore
rows_to_keep = [("UK","London"),("USA","New York")]

# Subset for rows to keep
print(temperatures_ind.loc[rows_to_keep])

                        date  avg_temp_c
country city
UK      London    2000-01-01      12.074
        London    2000-03-01       7.986
        London    2000-05-30      33.244
        London    2000-07-29      17.115
        London    2000-09-27      28.361
...                      ...         ...
USA     New York  2022-06-04       9.598
        New York  2022-12-31      10.916
        New York  2023-03-31      22.361
        New York  2023-12-26      23.426
        New York  2024-02-24      18.866

[108 rows x 2 columns]

In [19]:
# Sort temperatures_ind by index values
print(temperatures_ind.sort_index())

# Sort temperatures_ind by index values at the city level
print(temperatures_ind.sort_index(level = ['city']))

# Sort temperatures_ind by country then descending city
print(temperatures_ind.sort_index(level = ['country','city'],ascending=[True,False]))

                        date  avg_temp_c
country city
China   Xian      2000-03-31       7.115
        Xian      2000-08-28      16.472
        Xian      2000-11-26       3.282
        Xian      2001-05-25      -4.215
        Xian      2002-11-16      24.868
...                      ...         ...
USA     New York  2022-06-04       9.598
        New York  2022-12-31      10.916
        New York  2023-03-31      22.361
        New York  2023-12-26      23.426
        New York  2024-02-24      18.866

[300 rows x 2 columns]
                             date  avg_temp_c
country       city
Côte D'Ivoire Abidjan  2001-08-23      -3.333
              Abidjan  2001-11-21      27.603
              Abidjan  2002-06-19      -2.610
              Abidjan  2003-09-12      13.215
              Abidjan  2004-04-09      26.105
...                           ...         ...
China         Xian     2021-10-07      22.031
              Xian     2022-02-04       2.756
              Xian     2022-07-04      -3.097
              Xian     2022-08-03      -2.865
              Xian     2023-11-26      14.515

[300 rows x 2 columns]
                        date  avg_temp_c
country city
China   Xian      2000-03-31       7.115
        Xian      2000-08-28      16.472
        Xian      2000-11-26       3.282
        Xian      2001-05-25      -4.215
        Xian      2002-11-16      24.868
...                      ...         ...
USA     New York  2022-06-04       9.598
        New York  2022-12-31      10.916
        New York  2023-03-31      22.361
        New York  2023-12-26      23.426
        New York  2024-02-24      18.866

[300 rows x 2 columns]

In [20]:
# Sort the index of temperatures_ind
temperatures_srt = temperatures_ind.sort_index()

# Subset rows from Pakistan to Russia
print(temperatures_srt.loc["UK":"USA"])

# Try to subset rows from Lahore to Moscow
print(temperatures_srt.loc["London":"New York"])

# Subset rows from Pakistan, Lahore to Russia, Moscow
print(temperatures_srt.loc[("UK","London"):("USA","New York")])

                        date  avg_temp_c
country city
UK      London    2000-01-01      12.074
        London    2000-03-01       7.986
        London    2000-05-30      33.244
        London    2000-07-29      17.115
        London    2000-09-27      28.361
...                      ...         ...
USA     New York  2022-06-04       9.598
        New York  2022-12-31      10.916
        New York  2023-03-31      22.361
        New York  2023-12-26      23.426
        New York  2024-02-24      18.866

[108 rows x 2 columns]
Empty DataFrame
Columns: [date, avg_temp_c]
Index: []
                        date  avg_temp_c
country city
UK      London    2000-01-01      12.074
        London    2000-03-01       7.986
        London    2000-05-30      33.244
        London    2000-07-29      17.115
        London    2000-09-27      28.361
...                      ...         ...
USA     New York  2022-06-04       9.598
        New York  2022-12-31      10.916
        New York  2023-03-31      22.361
        New York  2023-12-26      23.426
        New York  2024-02-24      18.866

[108 rows x 2 columns]

In [22]:
# Subset rows from India, Hyderabad to Iraq, Baghdad
print(temperatures_srt.loc[('China','Xian'):('Japan','Tokyo')])

# Subset columns from date to avg_temp_c
print(temperatures_srt.loc[:,"date":"avg_temp_c"])

# Subset in both directions at once
print(temperatures_srt.loc[('China','Xian'):('Japan','Tokyo'),"date":"avg_temp_c"])

                     date  avg_temp_c
country city
China   Xian   2000-03-31       7.115
        Xian   2000-08-28      16.472
        Xian   2000-11-26       3.282
        Xian   2001-05-25      -4.215
        Xian   2002-11-16      24.868
...                   ...         ...
Japan   Tokyo  2022-12-01      10.222
        Tokyo  2023-09-27       5.030
        Tokyo  2024-01-25      17.854
        Tokyo  2024-05-24      32.287
        Tokyo  2024-07-23      17.669

[192 rows x 2 columns]
                        date  avg_temp_c
country city
China   Xian      2000-03-31       7.115
        Xian      2000-08-28      16.472
        Xian      2000-11-26       3.282
        Xian      2001-05-25      -4.215
        Xian      2002-11-16      24.868
...                      ...         ...
USA     New York  2022-06-04       9.598
        New York  2022-12-31      10.916
        New York  2023-03-31      22.361
        New York  2023-12-26      23.426
        New York  2024-02-24      18.866

[300 rows x 2 columns]
                     date  avg_temp_c
country city
China   Xian   2000-03-31       7.115
        Xian   2000-08-28      16.472
        Xian   2000-11-26       3.282
        Xian   2001-05-25      -4.215
        Xian   2002-11-16      24.868
...                   ...         ...
Japan   Tokyo  2022-12-01      10.222
        Tokyo  2023-09-27       5.030
        Tokyo  2024-01-25      17.854
        Tokyo  2024-05-24      32.287
        Tokyo  2024-07-23      17.669

[192 rows x 2 columns]

In [23]:
# Use Boolean conditions to subset temperatures for rows in 2010 and 2011
temperatures_bool = temperatures[(temperatures["date"] >= "2010-01-01") & (temperatures["date"] <= "2011-12-31")]
print(temperatures_bool)

# Set date as the index and sort the index
temperatures_ind = temperatures.set_index("date").sort_index()

# Use .loc[] to subset temperatures_ind for rows in 2010 and 2011
print(temperatures_ind.loc["2010":"2011"])

# Use .loc[] to subset temperatures_ind for rows from Aug 2010 to Feb 2011
print(temperatures_ind.loc["2010-08":"2011-02"])

           date      city        country  avg_temp_c
122  2010-01-08  New York            USA      32.843
123  2010-02-07    London             UK      13.410
124  2010-03-09     Tokyo          Japan       2.554
125  2010-04-08  New York            USA      20.041
126  2010-05-08     Delhi          India      16.643
127  2010-06-07    London             UK      34.822
128  2010-07-07  New York            USA      21.370
129  2010-08-06     Tokyo          Japan      12.544
130  2010-09-05   Abidjan  Côte D'Ivoire      16.350
131  2010-10-05    London             UK      12.849
132  2010-11-04     Delhi          India       4.485
133  2010-12-04   Abidjan  Côte D'Ivoire      14.036
134  2011-01-03  New York            USA      20.202
135  2011-02-02     Delhi          India      28.837
136  2011-03-04  New York            USA      20.879
137  2011-04-03  New York            USA      20.757
138  2011-05-03    London             UK      34.500
139  2011-06-02     Tokyo          Japan      15.738
140  2011-07-02  New York            USA      34.187
141  2011-08-01  New York            USA      14.088
142  2011-08-31     Delhi          India       4.036
143  2011-09-30     Tokyo          Japan      32.228
144  2011-10-30     Tokyo          Japan      -0.427
145  2011-11-29     Tokyo          Japan      -3.462
146  2011-12-29     Tokyo          Japan       4.006
                city        country  avg_temp_c
date
2010-01-08  New York            USA      32.843
2010-02-07    London             UK      13.410
2010-03-09     Tokyo          Japan       2.554
2010-04-08  New York            USA      20.041
2010-05-08     Delhi          India      16.643
2010-06-07    London             UK      34.822
2010-07-07  New York            USA      21.370
2010-08-06     Tokyo          Japan      12.544
2010-09-05   Abidjan  Côte D'Ivoire      16.350
2010-10-05    London             UK      12.849
2010-11-04     Delhi          India       4.485
2010-12-04   Abidjan  Côte D'Ivoire      14.036
                city        country  avg_temp_c
date
2010-08-06     Tokyo          Japan      12.544
2010-09-05   Abidjan  Côte D'Ivoire      16.350
2010-10-05    London             UK      12.849
2010-11-04     Delhi          India       4.485
2010-12-04   Abidjan  Côte D'Ivoire      14.036
2011-01-03  New York            USA      20.202

In [24]:
# Get 23rd row, 2nd column (index 22, 1)
print(temperatures.iloc[22,1])

# Use slicing to get the first 5 rows
print(temperatures.iloc[:5])

# Use slicing to get columns 3 to 4
print(temperatures.iloc[:,2:4])

# Use slicing in both directions at once
print(temperatures.iloc[:5,2:4])

London
         date      city country  avg_temp_c
0  2000-01-01    London      UK      12.074
1  2000-01-31  New York     USA      -0.714
2  2000-03-01    London      UK       7.986
3  2000-03-31      Xian   China       7.115
4  2000-04-30     Tokyo   Japan      29.439
           country  avg_temp_c
0               UK      12.074
1              USA      -0.714
2               UK       7.986
3            China       7.115
4            Japan      29.439
..             ...         ...
295             UK      10.597
296  Côte D'Ivoire      17.050
297          Japan      32.287
298  Côte D'Ivoire      32.983
299          Japan      17.669

[300 rows x 2 columns]
  country  avg_temp_c
0      UK      12.074
1     USA      -0.714
2      UK       7.986
3   China       7.115
4   Japan      29.439

In [26]:
# Ensure the date column is in datetime format
temperatures["date"] = pd.to_datetime(temperatures["date"])

# Add a year column to temperatures
temperatures["year"] = temperatures["date"].dt.year

# Pivot avg_temp_c by country and city vs year
temp_by_country_city_vs_year = temperatures.pivot_table("avg_temp_c", index=["country", "city"], columns="year")

# See the result
print(temp_by_country_city_vs_year)

year                         2000      2001     2002       2003     2004  \
country       city
China         Xian       8.956333  -4.21500  24.8680   9.868000      NaN
Côte D'Ivoire Abidjan         NaN  12.13500  -2.6100  13.215000  20.7290
India         Delhi     29.854000   4.46175  19.4790        NaN   5.1960
Japan         Tokyo     22.770000       NaN  18.6595   7.950333  15.5684
UK            London    20.490333  12.90300  11.7120  14.312750  16.1085
USA           New York  -0.714000  11.32150  26.1430   2.885000   9.6410

year                        2005       2006       2007       2008       2009  \
country       city
China         Xian      26.08800  11.371250  17.141500  21.091333  17.825500
Côte D'Ivoire Abidjan   20.83600  15.476667  11.478333  14.231333        NaN
India         Delhi      7.11200  -3.681000  23.571750  15.610000  25.112667
Japan         Tokyo     10.71600  -0.730000  -2.044000        NaN  11.521667
UK            London     7.65350        NaN  23.333000  30.176000        NaN
USA           New York   6.99525  12.690000  17.981000  16.301667  15.152500

year                    ...       2015       2016     2017       2018  \
country       city      ...
China         Xian      ...  24.523000  16.167250  12.9030   8.543333
Côte D'Ivoire Abidjan   ...  15.759333        NaN      NaN  18.372000
India         Delhi     ...  15.265667  34.158000  16.5280  16.146667
Japan         Tokyo     ...  19.605500  24.639333  25.6250   5.241000
UK            London    ...  18.586000  12.937667  20.0808  33.887000
USA           New York  ...  24.173000  34.969000  14.8080  26.700500

year                        2019     2020       2021       2022       2023  \
country       city
China         Xian      23.07275  20.4590  15.382333  -1.068667  14.515000
Côte D'Ivoire Abidjan    3.07900  11.6030   9.927000   6.620000  26.075000
India         Delhi      7.32450   9.4025  26.641000        NaN  15.006750
Japan         Tokyo     14.79475  -2.9000  17.493000   9.242500   5.030000
UK            London         NaN  17.5395  20.010333  17.296000   9.546667
USA           New York   4.73300   6.3830        NaN  11.739750  22.893500

year                         2024
country       city
China         Xian            NaN
Côte D'Ivoire Abidjan   25.016500
India         Delhi           NaN
Japan         Tokyo     22.603333
UK            London    10.597000
USA           New York  18.866000

[6 rows x 25 columns]

In [29]:
# Subset for Egypt to India
temp_by_country_city_vs_year.loc["China":"Japan"]

# Subset for Egypt, Cairo to India, Delhi
temp_by_country_city_vs_year.loc[("China","Xian"):("Japan","Tokyo")]

# Subset for Egypt, Cairo to India, Delhi, and 2005 to 2010
temp_by_country_city_vs_year.loc[("China","Xian"):("Japan","Tokyo"),"2005":"2010"]

,year,2005,2006,2007,2008,2009,2010
country,city,,,,,,
China,Xian,26.088,11.371250,17.141500,21.091333,17.825500,NaN
Côte D'Ivoire,Abidjan,20.836,15.476667,11.478333,14.231333,NaN,15.193
India,Delhi,7.112,-3.681000,23.571750,15.610000,25.112667,10.564
Japan,Tokyo,10.716,-0.730000,-2.044000,NaN,11.521667,7.549

In [30]:
# Get the worldwide mean temp by year
mean_temp_by_year = temp_by_country_city_vs_year.mean()

# Filter for the year that had the highest mean temp
print(mean_temp_by_year[mean_temp_by_year == mean_temp_by_year.max()])

# Get the mean temp by city
mean_temp_by_city = temp_by_country_city_vs_year.mean(axis ='columns')

# Filter for the city that had the lowest mean temp
print(mean_temp_by_city[mean_temp_by_city==mean_temp_by_city.min()])

year
2016    24.57425
dtype: float64
country  city
Japan    Tokyo    11.66786
dtype: float64